zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F83xxx/MC56F83686/codewarrior/MC56F83686_Vectors.c
/******************* Default ISR for DMA1 **********************/
/* Double weak ISR mechanism for DMA1 to facilitate SDK usage. */

/* User could redefine the DMA1_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void DMA1_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_DMA1.
Please be noted that ivINT_DMA1 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_DMA1 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_DMA1(void);
__attribute__((weak)) void ivINT_DMA1(void)
{
    DMA1_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for DMA0 **********************/
/* Double weak ISR mechanism for DMA0 to facilitate SDK usage. */

/* User could redefine the DMA0_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void DMA0_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_DMA0.
Please be noted that ivINT_DMA0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_DMA0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_DMA0(void);
__attribute__((weak)) void ivINT_DMA0(void)
{
    DMA0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CAN_MB_OR **********************/

/* ivINT_CAN_xxx share same CAN0_DriverIRQHandler.
User could redefine the CAN0_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void CAN0_DriverIRQHandler(void)
{
    default_interrupt();
}

/* Double weak ISR mechanism for CAN_MB_OR to facilitate SDK usage. */

/* User could redefine ivINT_CAN_MB_OR.
Please be noted that ivINT_CAN_MB_OR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CAN_MB_OR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CAN_MB_OR(void);
__attribute__((weak)) void ivINT_CAN_MB_OR(void)
{
    CAN0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CAN_BUS_OFF **********************/
/* Double weak ISR mechanism for CAN_BUS_OFF to facilitate SDK usage. */

/* User could redefine ivINT_CAN_BUS_OFF.
Please be noted that ivINT_CAN_BUS_OFF can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CAN_BUS_OFF definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CAN_BUS_OFF(void);
__attribute__((weak)) void ivINT_CAN_BUS_OFF(void)
{
    CAN0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CAN_ERROR **********************/
/* Double weak ISR mechanism for CAN_ERROR to facilitate SDK usage. */

/* User could redefine ivINT_CAN_ERROR.
Please be noted that ivINT_CAN_ERROR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CAN_ERROR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CAN_ERROR(void);
__attribute__((weak)) void ivINT_CAN_ERROR(void)
{
    CAN0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CAN_TX_WARN **********************/
/* Double weak ISR mechanism for CAN_TX_WARN to facilitate SDK usage. */

/* User could redefine ivINT_CAN_TX_WARN.
Please be noted that ivINT_CAN_TX_WARN can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CAN_TX_WARN definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CAN_TX_WARN(void);
__attribute__((weak)) void ivINT_CAN_TX_WARN(void)
{
    CAN0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CAN_RX_WARN **********************/
/* Double weak ISR mechanism for CAN_RX_WARN to facilitate SDK usage. */

/* User could redefine ivINT_CAN_RX_WARN.
Please be noted that ivINT_CAN_RX_WARN can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CAN_RX_WARN definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CAN_RX_WARN(void);
__attribute__((weak)) void ivINT_CAN_RX_WARN(void)
{
    CAN0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CAN_WAKEUP **********************/
/* Double weak ISR mechanism for CAN_WAKEUP to facilitate SDK usage. */

/* User could redefine ivINT_CAN_WAKEUP.
Please be noted that ivINT_CAN_WAKEUP can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CAN_WAKEUP definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CAN_WAKEUP(void);
__attribute__((weak)) void ivINT_CAN_WAKEUP(void)
{
    CAN0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QSCI2_RERR **********************/
/* Double weak ISR mechanism for QSCI2_RERR to facilitate SDK usage. */

/* User could redefine the QSCI2_RERR_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void QSCI2_RERR_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_QSCI2_RERR.
Please be noted that ivINT_QSCI2_RERR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_QSCI2_RERR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_QSCI2_RERR(void);
__attribute__((weak)) void ivINT_QSCI2_RERR(void)
{
    QSCI2_RERR_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QSCI2_RCV **********************/
/* Double weak ISR mechanism for QSCI2_RCV to facilitate SDK usage. */

/* User could redefine the QSCI2_RCV_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void QSCI2_RCV_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_QSCI2_RCV.
Please be noted that ivINT_QSCI2_RCV can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_QSCI2_RCV definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_QSCI2_RCV(void);
__attribute__((weak)) void ivINT_QSCI2_RCV(void)
{
    QSCI2_RCV_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QSCI2_TRIDLE **********************/
/* Double weak ISR mechanism for QSCI2_TRIDLE to facilitate SDK usage. */

